jamesdabai/stm32_mp3/HARDWARE/dev_key.c
	PORT_SetPinMux(KEY_ROW_PORT, PORTB16, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_ROW_GPIO, PORTB16, &output_config);	  // set as  output
	//GPIO_WritePinOutput(KEY_ROW_GPIO, PORTB16, LOW_LEVEL);    // output 0	

	PORT_SetPinMux(KEY_ROW_PORT, PORTB17, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_ROW_GPIO, PORTB17, &output_config);	  // set as  output
	//GPIO_WritePinOutput(KEY_ROW_GPIO, PORTB17, LOW_LEVEL);    // output 0	

	PORT_SetPinMux(KEY_ROW_PORT, PORTB18, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_ROW_GPIO, PORTB18, &output_config);	  // set as  output
	//GPIO_WritePinOutput(KEY_ROW_GPIO, PORTB18, LOW_LEVEL);    // output 0	

    //col input
    PORT_SetPinInterruptConfig(KEY_COL_PORT, PORTB0, kPORT_InterruptFallingEdge);
	PORT_SetPinMux(KEY_COL_PORT, PORTB0, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_COL_GPIO, PORTB0, &input_config);		  // input
	PORT_SetPinConfig(KEY_COL_PORT, PORTB0, &pin_pull_Config); 	  // enable pull up

    PORT_SetPinInterruptConfig(KEY_COL_PORT, PORTB1, kPORT_InterruptFallingEdge);
	PORT_SetPinMux(KEY_COL_PORT, PORTB1, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_COL_GPIO, PORTB1, &input_config);		  // input
	PORT_SetPinConfig(KEY_COL_PORT, PORTB1, &pin_pull_Config); 	  // enable pull up	

    PORT_SetPinInterruptConfig(KEY_COL_PORT, PORTB2, kPORT_InterruptFallingEdge);
	PORT_SetPinMux(KEY_COL_PORT, PORTB2, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_COL_GPIO, PORTB2, &input_config);		  // input
	PORT_SetPinConfig(KEY_COL_PORT, PORTB2, &pin_pull_Config); 	  // enable pull up

    PORT_SetPinInterruptConfig(KEY_COL_PORT, PORTB3, kPORT_InterruptFallingEdge);
	PORT_SetPinMux(KEY_COL_PORT, PORTB3, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_COL_GPIO, PORTB3, &input_config);		  // input
	PORT_SetPinConfig(KEY_COL_PORT, PORTB3, &pin_pull_Config); 	  // enable pull up	

   

	EnableIRQ(PORTB_IRQn);
}

/****************************************************************************
**Description:      关闭按键中断功能     
**Input parameters:  
**Output parameters: 
**                   
**Returned value:        
**                   
**Created by:            hxj(2014-4-28)
**--------------------------------------------------------------------------
**Modified by:      
**Modified by:      
****************************************************************************/
void drv_key_wakeup(void)
{
    gpio_pin_config_t output_config = {
        kGPIO_DigitalOutput, HIGH_LEVEL,
    };
    DisableIRQ(PORTB_IRQn);
    // col output 1
	PORT_SetPinMux(KEY_COL_PORT, PORTB0, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_COL_GPIO, PORTB0, &output_config);	      // set as  output
	//GPIO_WritePinOutput(KEY_COL_GPIO, PORTB0, HIGH_LEVEL);    // output 1	
	
	PORT_SetPinMux(KEY_COL_PORT, PORTB1, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_COL_GPIO, PORTB1, &output_config);	      // set as  output
	//GPIO_WritePinOutput(KEY_COL_GPIO, PORTB1, HIGH_LEVEL);    // output 1	

	PORT_SetPinMux(KEY_COL_PORT, PORTB2, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_COL_GPIO, PORTB2, &output_config);	      // set as  output
	//GPIO_WritePinOutput(KEY_COL_GPIO, PORTB2, HIGH_LEVEL);    // output 1	

	PORT_SetPinMux(KEY_COL_PORT, PORTB3, kPORT_MuxAsGpio);	  // set as gpio
	GPIO_PinInit(KEY_COL_GPIO, PORTB3, &output_config);	      // set as  output
	//GPIO_WritePinOutput(KEY_COL_GPIO, PORTB3, HIGH_LEVEL);    // output 1	

	

	drv_key_init();
}
#endif


/********************************Copyright ( c ) ***************************
**                  Shenzhen Xinguodu Technology Co., LTD.
**                        http://www.xinguodu.com
**
**
**Created By:     hxj
**Created Date:       2014-3-13
**Version:            <version >
**Description:    按键接口
**
****************************************************************************/


//逐行扫描时，结构按键在扫描得到的按键状态的位置

struct _key_pra
{
    u8 jiegou;//结构按键值(物理按键值)，左上右上左下右下，从1开始
    u8 sch; //线路图按键值 左上右上左下右下，从1开始
    u32 line_mask;//逐行扫描的状态掩码
};


//这个是K200P的
const struct _key_pra KeyPra[16]=
{
    18, 14, 10,//0
    5,  1,  12,//1
    6,  2,  8,//2
    7,  3,  4,//3
    9,  5,  0,//4
    10, 6,  13,//5
    11, 7,  9,//6
    13, 9,  5,//7
    14, 10, 1,//8
    15, 11, 14,//9
    12, 13, 2,//取消
    16, 17, 6,//清除
    17, 18, 15,//上
    19, 12, 7,//下
    20, 15, 3,//确认
    20, 15, 11,//关机
};

const struct _key_fun_tab key_fun_tab[21]=
{
    "null\0",
    "on/off\0",
    "f\0",
    "f1\0",
    "f2\0",
    "ch1\0",
    "ch2\0",
    "ch3\0",
    "ch\0",
    "ch4\0",
    "ch5\0",
    "ch6\0",
    "cancel\0",
    "ch7\0",
    "ch8\0",
    "ch9\0",
    "clr\0",
    "up\0",
    "ch0\0",
    "down\0",
    "enter\0"
};//20个按键

#define key_buf_max 8//64  //sxlneicun

struct _key_buf
{
    u32 value[key_buf_max];
    u8 head;
    u8 end;
};

static struct _key_buf key_buf;

struct _key_ctrl
{

    u32 lastkey;//上一次上报的键值
    u32 timeid;//上次上报按键的时间
    u32 holdtime;//按键按下时间点，用于报卡键
    u32 delay;//过多长时间再报一次
    u32 last_key_sta;
    u8 keysta;//1 有键按下，0无键按下
    u8 holdflag;//卡键标识
    u8 longpress;

};

static struct _key_ctrl KeyCtrl;
static u8 KeyGd = 0;

#define KEY_LONGPRESS_OTHER_DELAY (200)//MS 长按键上报间隔

#define KEY_LONGPRESS_FRIST_DELAY (2000)//MS//长按键时间
#define KEY_PWRONOFF_DELAY      (3000)//ms//开关机响应时间
#define KEY_HOLD_ERR_TIME       (10*1000)//10s算卡键
/****************************************************************************
**Description:
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-3-11)
**--------------------------------------------------------------------------
**Modified by:
**Modified by:
****************************************************************************/
s32 dev_key_init()
{
    key_buf.end = 0;
    key_buf.head = 0;

    KeyCtrl.longpress = 0;//默认不开启长按键
    KeyCtrl.keysta = 0;
    KeyCtrl.holdflag = 0;
    (KeyCtrl.last_key_sta) = 0xffffffff;
    drv_key_init();
    return 0;
}
/****************************************************************************
**Description:      打开按键
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-3-11)
**--------------------------------------------------------------------------
**Modified by:
**Modified by:
****************************************************************************/
s32 dev_key_open(void)
{
    KeyGd = 1;
    return 0;
}

/****************************************************************************
**Description:      关闭按键
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-3-11)
**--------------------------------------------------------------------------
**Modified by:
**Modified by:
****************************************************************************/
s32 dev_key_close(void)
{
    KeyGd = 0;
    return 0;
}

/****************************************************************************
**Description:      清物理键值缓冲
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-3-11)
**--------------------------------------------------------------------------
**Modified by:
**Modified by:
****************************************************************************/
s32 dev_key_clear(void)
{
    key_buf.end = key_buf.head;
    return 0;
}

/****************************************************************************
**Description:      读物理键值
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-3-11)
**--------------------------------------------------------------------------
**Modified by:
**Modified by:
****************************************************************************/
s32 dev_key_read(u32 *lpKey)
{
    if(key_buf.head != key_buf.end)
    {
        *lpKey = key_buf.value[key_buf.end++];
        if(key_buf.end >= key_buf_max)
            key_buf.end = 0;
    }
    else
    {
        *lpKey = 0;
    }

