jamesdabai/stm32_mp3/HARDWARE/dev_key.c
}

/****************************************************************************
**Description:
**Input parameters:
**Output parameters:
**
**Returned value:
**
**Created by:            hxj(2014-5-7)
**--------------------------------------------------------------------------
**Modified by:      2014.05.07 测试OK
**Modified by:
****************************************************************************/
s32 ddi_key_ioctl(u32 nCmd, u32 lParam, u32 wParam)
{
    ;

    if(DdiKeyGd == -1)//设备为打开
    {
        return DDI_EIO;
    }

    return dev_key_ioctl(nCmd, lParam, wParam);
}




static const u32 keyfun[21]=
{
    0,
    0,    FUNCTION,    F1,    F2,
    '1', '2',  '3',   ALPHA,
    '4', '5',  '6',   ESC,
    '7', '8',  '9',   CLR,
    '*', '0',  '#',   ENTER,
};


/*
    在应用任务中调用，不需要扫描按键
    乱，，，，hxj 2015.06.13
*/
s32 dev_key_fun_read(u32 *fun_key)
{
    u32 key;

    dev_key_read(&key);

    if(
        ((key & 0x000000ff) != 0)
        && ((key & 0xffffff00) == 0)
    )//测试程序不处理多键
    {
        if(key == KEY_ONOFF_HOLD)
        {
            *fun_key = key;
            return 0;
        }

        //dev_buzzer_open(100);

        *fun_key = keyfun[key&0x000000ff];

    }
    else
        *fun_key = 0;

    return 0;
}


#if 1 /*xqy 2018-6-7*/
//////////////////////////////暂时用开发板上的3个按键--代码//////////////////////
static struct _key_buf KEY_BUFF;

//按键初始化函数
void KEY_Init(void)
{
	GPIO_InitTypeDef  GPIO_InitStructure;
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA|RCC_AHB1Periph_GPIOE, ENABLE);//使能GPIOA,GPIOE时钟
 
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3|GPIO_Pin_4; //KEY2 KEY3对应引脚
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;//普通输入模式
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//100M
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//上拉
    GPIO_Init(GPIOE, &GPIO_InitStructure);//初始化GPIOE2,3,4
	
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;//WK_UP对应引脚PA0
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN ;//下拉
    GPIO_Init(GPIOA, &GPIO_InitStructure);//初始化GPIOA0

    KEY_BUFF.end = 0;
    KEY_BUFF.head = 0;
 
} 
static s32 key_write(u32 key)
{
    KEY_BUFF.value[KEY_BUFF.head++] = key;//最大储存8个按键值
    if(KEY_BUFF.head >= key_buf_max)
        KEY_BUFF.head = 0;
    return 0;
}
s32 key_read(u32 *lpKey)
{
    if(KEY_BUFF.head != KEY_BUFF.end)
    {
        *lpKey = KEY_BUFF.value[KEY_BUFF.end++];
        if(KEY_BUFF.end >= key_buf_max)
            KEY_BUFF.end = 0;
    }
    else
    {
        *lpKey = 0;
    }

    return 0;
}
s32 key_clear(void)
{
    KEY_BUFF.end = KEY_BUFF.head;
    return 0;
}

//mode:0,不支持连续按;1,支持连续按;
//0，没有任何按键按下
//1，KEY0按下
//2，KEY1按下
//4，WKUP按下 WK_UP
//注意此函数有响应优先级,KEY0>KEY1>KEY2>WK_UP!!
u8 KEY_Scan(u8 mode)
{	 
	static u8 key_up_flag=1;//按键按松开标志
	if(mode)
	    key_up_flag=1;  //支持连按		  
	if(key_up_flag&&(KEY0==0||KEY1==0||WK_UP==1))
	{
		delay_os(20);//delayms(10);//去抖动 
		key_up_flag=0;
		if(KEY0==0)
		{
		    key_write(key0);
		}
		else if(KEY1==0)
		{
		    key_write(key1);
		}
		else if(WK_UP==1)
		{
		    key_write(key_up_flag);
		}
		else if(KEY0==0 && KEY1==0)
		{
		    key_write(key0_1);
		}
		else if(KEY0==0 && WK_UP==1)
		{
		    key_write(key0_up);
		}
		else if(KEY1==0 && WK_UP==1)
		{
		    key_write(key1_up);
		}
	}
	else if(KEY0==1&&KEY1==1&&WK_UP==0)
	{
	    key_up_flag=1; 	
	}
 	return 0;// 无按键按下
}
#endif






